{
    "experience_section": {
       "experience_section_name": "Experience",
       "subsection": [
          {
             "subsection_name": "Portworx (Acquired by Pure Storage)",
             "job": [
                {
                  "job_titles": [
                     {
                     "job_title": "Manager, Technical Documentation",
                     "tenure": "April 2022 - Present"
                     },
                     {
                        "job_title": "Lead Technical Writer",
                        "tenure": "May 2021 - April 2022"
                     },
                     {
                        "job_title": "Technical Writer",
                        "tenure": "July 2019 - May 2021"
                     }
                  ],
                  "focus_area": [
                     {
                        "focus_area_name": "Leadership",
                        "focus_area_list": [
                          "Hired and developed a team of full-time writers in both the US and India to support a growing Portworx product line: Portworx Data Services, Portworx Backup as-a-Service, Portworx Central On-prem.",
                          "Developed a docs-as-code/markdown contribution model powerful enough for technical writing needs, but intuitive and accessible enough for other departments to contribute through PRs. Put various guardrails and checks in place through GitHub Actions to ensure all contributors adhere to documentation standards. Taught contribution methods in open sessions across the business unit.",
                          "Prototyped an internal AI chatbot POC using a RAG method to answer common questions and provide documentation links to users, then collaborated with engineering to develop it into a beta version.",
                          "Created bespoke Portworx Enterprise documentation sets, allowing users to view instructions specific to their platform, then single-sourced content to prevent article count expansion by 15x.",
                          "Planned and defined a strategic roadmap and documentation strategy that meets customers' needs, adheres to budgetary requirements, and utilizes automation and AI to improve accuracy and multiply efficiency.",
                          "Prototyped and designed workflows for automating release notes process using generative AI as part of the Pure Storage AI Governance Council, reducing release notes writing effort by half.",
                          "Managed direct reports using Jira and GitHub to define and triage work, delegate tasks, and monitor progress."
                        ]
                     },
                     {
                        "focus_area_name": "Product Documentation",
                        "focus_area_list": [
                          "Authored documentation and release notes for 88 Portworx Enterprise Kubernetes storage platform releases and hotfixes, spanning a $27M Series C through a $370M exit.",
                          "Expanded Portworx documentation from a single product to multiple spanning new product lines; launched PX-Backup 1.0 documentation and handed off further writing to a direct report."
                        ]
                     },
                     {
                        "focus_area_name": "Infrastructure",
                        "focus_area_list": [
                          "Rearchitected docs.portworx.com, removing maintenance burdens and centralizing content onto one site for a single-pane-of-glass experience.",
                          "Built custom authoring tools as React components: text variables, includes with conditional content, link cards, text highlights, a feedback form.",
                          "Built a table automation tool for parsing upstream source data for the pxctl command into a reference, eliminating the need for manual updates and ensuring that this reference will remain up-to-date indefinitely.",
                          "Built a custom data file and parser for storing reference data in a single location and automating data pulls anywhere desired in documentation, making reference data easier for contributors to find and maintain.",
                          "Refactored Algolia InstantSearch and implemented federated search, allowing users to search and instantly see results across multiple products. Added facets to constrain results to specific products, orchestrators, and platforms.",
                          "Managed GKE cluster ingress and TLS certificates, then replaced it with a service to lower the maintenance burden."
                        ]
                     }
                  ]
                }
             ]
          },
          {
             "subsection_name": "Celtra",
             "job": [
               {
                 "job_titles": [
                  {
                     "job_title": "Technical Writer",
                     "tenure": "July 2018 - February 2019"
                  }
               ],
                 "focus_area": [
                     {
                        "focus_area_name": "",
                        "focus_area_list": [
                           "Wrote and maintained support documentation for the Celtra Management Platform.",
                           "Performed front-end development and administrative tasks for support.celtra.com.",
                           "Created interactive website documentation designs such as animated tables, feedback buttons and forms, and landing pages using JavaScript."
                        ]
                     }
                  ]
               }
            ]
          },
          {
             "subsection_name": "Red Hat",
             "job": [
               {

                  "job_titles": [
                     {
                        "job_title": "Technical Writer",
                        "tenure": "January 2017 - July 2018"
                     }
                  ],
                  "focus_area": [
                     {
                        "focus_area_name": "",
                        "focus_area_list": [
                           "Wrote and maintained documentation as the sole writer for the Red Hat 3scale API Management Platform.",
                           "Migrated documentation from legacy formats to AsciiDoc and placed it into GitLab repositories.",
                           "Implemented documentation initiatives: modularity, open sourcing."
                        ]
                     }
                  ]
               }
            ]
          },
          {
             "subsection_name": "Hewlett Packard Enterprise",
             "job": [
               {
                  "job_titles": [
                     {
                        "job_title": "Technical Writer",
                        "tenure": "August 2014 - January 2017"
                     }
                  ],
                  "focus_area": [
                     {
                        "focus_area_name": "",
                        "focus_area_list": [
                           "Established a release publications team, designed a release process, and instructed team members on release procedures; during releases, delegated team tasks for product releases on my.vertica.com and oversaw publication operations.",
                           "Created and maintained documentation for HPE Software cloud products, including backup/restore, connector, and configuration guides.",
                           "Modernized documentation using topic-based authoring standards.",
                           "Implemented and reported on analytics for the documentation and community using Google Analytics."
                        ]
                     }
                  ]
               }
            ]
          }
       ]
    },
    "skills_section": {
       "skills_section_name": "Skills",
       "subsection": [
          {
             "subsection_name": "Markup Languages",
             "subsection_list": [
                "Markdown",
                "Asciidoc"
             ]
          },
          {
            "subsection_name": "Operating Systems",
            "subsection_list": [
              "MacOS", 
              "Linux"
            ]
         },
         {
             "subsection_name": "Static Site Generators",
             "subsection_list": [
               "Docusaurus",
               "Hugo",
               "Jekyll",
               "Statamic"
             ]
          },
          {
            "subsection_name": "Programming & Query Languages",
            "subsection_list": [
               "Javascript/Node.js",
               "Python",
               "C",
               "SQL"
            ]
         },
          {
             "subsection_name": "Web Languages & Utilities",
             "subsection_list": [
                "HTML/CSS",
                "Javascript",
                "React"
             ]
          },
          {
             "subsection_name": "Cloud Platforms",
             "subsection_list": [
                "Amazon Web Services (AWS)",
                "Microsoft Azure",
                "Google Cloud Platform (GCP)"
             ]
          },
          {
             "subsection_name": "Containers",
             "subsection_list": [
                "Kubernetes",
                "Google Kubernetes Engine (GKE)",
                "Openshift container platform (OCP)"
             ]
          },
          {
             "subsection_name": "Development tools",
             "subsection_list": [
                "Git, GitHub",
                "ChatGPT, Copilot"
             ]
          }
       ]
    },
    "education_section": {
       "education_section_name": "Education",
       "subsection": [
          {
             "subsection_name": "University of North Texas",
             "degree_name": "BA English, Technical Writing concentration",
             "graduation_date": "2013" 
          },
          {
            "subsection_name": "Western Governors University",
            "degree_name": "Additional coursework in computer science and networking",
            "graduation_date": "2019" 
         }
       ]
    }
}